from typing_extensions import TYPE_CHECKING

if TYPE_CHECKING:
    from src.models import Transaction


class UserMessages:
    """Сообщения для пользователя"""

    MESSAGE_START: str = (
        "🎉 Добро пожаловать в AIVideos\n\n"
        + "Первый бот создающий из фотографий полноценные ии видео неотличимое от реального."
    )

    MESSAGE_USER_INFO_MENU: str = (
        "Привет дорогой друг, это твой личный профиль, здесь ты сможешь:\n"
        + "посмотреть свою статистику, пополнить баланс, пригласить своих друзей"
    )

    MESSAGE_GENERATE_VIDEO: str = (
        "Здесь вы можете создать свое видео, отправьте фото модели!\n"
        + "Перед отправкой фото, посмотрите обучающее видео\n"
    )

    MESSAGE_REFERAL: str = (
        "Пригласи друзей и получай бонусы!\n"
        + "Каждый новый пользователь, который пришел по твоей ссылке, дает тебе бонусы."
    )

    @staticmethod
    def referals_message(
        botname: str,
        referal_code: str,
        referal_count: int,
        transactions: list[Transaction],
    ) -> str:
        ref_link = f"https://t.me/{botname}?start={referal_code}"
        amount = sum(transaction.amount for transaction in transactions)
        return (
            "Ты можешь пригласить друзей и получать бонусы!\n"
            + "Каждый новый пользователь, который пришел по твоей ссылке, дает тебе бонусы.\n"
            + f"Уже приглашеные: {referal_count}\n"
            + f"Сумма бонусов: {amount} руб.\n"
            + f"<a href='{ref_link}'>Ссылка для приглашения</a>"
        )
